task10();
task13();
task15();



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 456 -> 5 //
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void task10()
{
    String number;
    while (true)
    {
        Console.Write("Введите трехзначное число: ");
        number = Console.ReadLine();
        if (number.Length == 3) break;
        Console.Write("Число не трехзначное! ");
    }
    printSecondDigit(number);
}

void printSecondDigit(String number)
{
    Console.WriteLine(number[1]);
}


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. 645 -> 5 //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void task13()
{
    Console.Write("Введите число: ");
    String number = Console.ReadLine();
    if (number.Length < 3)
    {
        Console.Write("Третьей цифры нет");
        return;
    }
    printThirdDigit(number);
}

void printThirdDigit(String number)
{
    Console.WriteLine(number[2]);
}


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным. 6 -> да //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void task15()
{
    int number;
    while (true)
    {
        Console.WriteLine("Чтобы выйти введите число 0.");
        Console.Write("Введите число обозначающую день недели: ");
        number = int.Parse(Console.ReadLine());
        if (number == 0) break;
        if (number > 0 && number <= 7)
        {
            if (number == 6 || number == 7)
            {
                Console.WriteLine(number + " -> да");
            }
            else
            {
                Console.WriteLine(number + " -> нет");
            }
        }
        else
        {
            Console.WriteLine("Цифра не обозначает день недели!\n");
        }
    }
}